Terraform Plan:

```
github_repository.infra_template: Refreshing state... [id=aws-infra-template-tf]
github_branch_protection.infra_template_barnch_protection: Refreshing state... [id=BPR_kwDOLBk3bM4CuH9-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.dev_assume_role will be created
  + resource "github_actions_secret" "dev_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "DEV_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.prod_assume_role will be created
  + resource "github_actions_secret" "prod_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "PROD_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.stage_assume_role will be created
  + resource "github_actions_secret" "stage_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "STAGE_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be updated in-place
  ~ resource "github_branch_protection" "infra_template_barnch_protection" {
        id                              = "BPR_kwDOLBk3bM4CuH9-"
        # (12 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_terraform_template_repo.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_terraform_template_repo.tfplan"
stdout<<ghadelimiter_5522e97b-4609-4597-9fb3-40d6755c91cd
github_repository.infra_template: Refreshing state... [id=aws-infra-template-tf]
github_branch_protection.infra_template_barnch_protection: Refreshing state... [id=BPR_kwDOLBk3bM4CuH9-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.dev_assume_role will be created
  + resource "github_actions_secret" "dev_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "DEV_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.prod_assume_role will be created
  + resource "github_actions_secret" "prod_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "PROD_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.stage_assume_role will be created
  + resource "github_actions_secret" "stage_assume_role" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "aws-infra-template-tf"
      + secret_name     = "STAGE_ASSUME_ROLE"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.infra_template_barnch_protection will be updated in-place
  ~ resource "github_branch_protection" "infra_template_barnch_protection" {
        id                              = "BPR_kwDOLBk3bM4CuH9-"
        # (12 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "/JosiahBurnham",
            ]
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/repos_terraform_template_repo.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/repos_terraform_template_repo.tfplan"

ghadelimiter_5522e97b-4609-4597-9fb3-40d6755c91cd
stderr<<ghadelimiter_e8002d02-493c-42e6-9be9-1dfbaf6d9cae

ghadelimiter_e8002d02-493c-42e6-9be9-1dfbaf6d9cae
exitcode<<ghadelimiter_f94d6215-8330-4ddf-be46-5b2b533fc7c7
0
ghadelimiter_f94d6215-8330-4ddf-be46-5b2b533fc7c7
```